; domain
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (domain ballooning)
     (:requirements :typing :fluents)
     (:types
          balloon passenger - object
     )
     (:predicates
          (rescued ?t - passenger)
     )
     (:functions
          (col ?b - balloon)
          (row ?b - balloon)
          (band ?t - passenger)
     )
     ;; Increment the value in the given counter by one
     (:action drift_northeast
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 1.5) (increase (row ?b) 1.5))
     )
     (:action drift_northwest
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 1.5) (increase (row ?b) 1.5))
     )
     (:action drift_east
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 3))
     )
     (:action drift_west
          :parameters (?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 3))
     )
     (:action drift_southwest
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and(increase (col ?b) 2) (decrease (row ?b) 2))
     )
     (:action drift_southeast
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and(decrease (col ?b) 2) (decrease (row ?b) 2))
     )
     (:action drift_south
          :parameters(?b - balloon)
          :precondition (and)
          :effect (and (decrease (row ?b) 2))
     )
     (:action rescue_passenger
          :parameters(?b - balloon ?t - passenger)
          :precondition ( and (>= (+ (col ?b) (row ?b)) (band ?t))
               (>= (- (row ?b) (col ?b)) (band ?t))
               (<= (+ (col ?b) (row ?b)) (+ (band ?t) 25))
               (<= (- (row ?b) (col ?b)) (+ (band ?t) 25))
          )
          :effect (and(rescued ?t))
     )

)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem ballooning-p04)

	(:domain ballooning)

	(:objects
		g0 - balloon
		r0 r1 - passenger
	)

  (:init
		(= (col g0) 1)
(= (row g0) 0)

		(= (band r0) 0)
(= (band r1) 2)

	)

	(:goal
		(and
			(rescued r0)
(rescued r1)
		)
	)
)

; plan
1. (drift_northwest g0)
   changed: (col g0) from 1 to -0.5, (row g0) from 0 to 1.5
   goals met: 0 of 2
2. (rescue_passenger g0 r0)
   added: (rescued r0)
   goals met: 1 of 2
3. (drift_northeast g0)
   changed: (col g0) from -0.5 to 1, (row g0) from 1.5 to 3
   goals met: 1 of 2
4. (rescue_passenger g0 r1)
   added: (rescued r1)
   goals met: 2 of 2
